app/Controllers/Siswa/Dashboard.php

SELECT *
FROM `classes`
WHERE `classes`.`id` = '1'
SELECT *
FROM `subjects`
---
    public function index()
    {
        $student         = (new StudentModel())->findByUserId(auth_id());
        $className       = null;
        $courses         = [];
        $subjectNames    = [];
        $progress        = ['total' => 0, 'viewed' => 0, 'percent' => 0];
        $assignmentStats = ['total' => 0, 'open' => 0, 'submitted' => 0, 'graded' => 0, 'closed' => 0, 'average' => null];
        $upcoming        = [];
        $quizStats       = ['total' => 0, 'available' => 0, 'submitted' => 0, 'upcoming' => 0, 'closed' => 0, 'average' => null];
        $quizUpcoming    = [];

        if ($student) {
            $student   = (array) $student;
            $studentId = (int) $student['id'];

            if (! empty($student['class_id'])) {
                $class     = (new ClassModel())->find($student['class_id']);
                $className = $class ? ((array) $class)['name'] : null;
            }

            $courses = array_map(
                static fn ($row) => (array) $row,
                (new CourseModel())->getByStudent($studentId)
            );

            foreach ((new SubjectModel())->findAll() as $s) {

SELECT `a`.`id`, `a`.`title`, `a`.`due_at`, `a`.`course_id`, `c`.`title` AS `course_title`, `sub`.`submitted_at`, `sub`.`graded_at`, `sub`.`score`
FROM `assignments` `a`
JOIN `courses` `c` ON `c`.`id` = `a`.`course_id`
JOIN `course_students` `cs` ON `cs`.`course_id` = `a`.`course_id`
LEFT JOIN `submissions` `sub` ON `sub`.`assignment_id` = `a`.`id` AND `sub`.`student_id` = 2
WHERE `cs`.`student_id` = 2
AND `a`.`is_published` = 1
---
    private function assignmentOverview(int $studentId): array
    {
        $rows = \Config\Database::connect()
            ->table('assignments a')
            ->select('a.id, a.title, a.due_at, a.course_id, c.title AS course_title, sub.submitted_at, sub.graded_at, sub.score')
            ->join('courses c', 'c.id = a.course_id')
            ->join('course_students cs', 'cs.course_id = a.course_id')
            ->join('submissions sub', 'sub.assignment_id = a.id AND sub.student_id = ' . $studentId, 'left')
            ->where('cs.student_id', $studentId)
            ->where('a.is_published', 1)
            ->get()
            ->getResultArray();

SELECT `q`.`id`, `q`.`title`, `q`.`course_id`, `q`.`duration_minutes`, `q`.`start_at`, `q`.`end_at`, `q`.`is_published`, `c`.`title` AS `course_title`, `qa`.`id` AS `attempt_id`, `qa`.`status` AS `attempt_status`, `qa`.`score` AS `attempt_score`, `qa`.`started_at` AS `attempt_started_at`
FROM `quizzes` `q`
JOIN `courses` `c` ON `c`.`id` = `q`.`course_id`
JOIN `course_students` `cs` ON `cs`.`course_id` = `q`.`course_id`
LEFT JOIN `quiz_attempts` `qa` ON `qa`.`quiz_id` = `q`.`id` AND `qa`.`student_id` = 2
WHERE `cs`.`student_id` = 2
AND `q`.`is_published` = 1
---
    private function quizOverview(int $studentId): array
    {
        $rows = \Config\Database::connect()
            ->table('quizzes q')
            ->select(
                'q.id, q.title, q.course_id, q.duration_minutes, q.start_at, q.end_at, q.is_published, '
                . 'c.title AS course_title, '
                . 'qa.id AS attempt_id, qa.status AS attempt_status, qa.score AS attempt_score, qa.started_at AS attempt_started_at'
            )
            ->join('courses c', 'c.id = q.course_id')
            ->join('course_students cs', 'cs.course_id = q.course_id')
            ->join('quiz_attempts qa', 'qa.quiz_id = q.id AND qa.student_id = ' . $studentId, 'left')
            ->where('cs.student_id', $studentId)
            ->where('q.is_published', 1)
            ->get()
            ->getResultArray();