app/Controllers/Guru/Dashboard.php

    public function index()
    {
        $teacher            = (new TeacherModel())->findByUserId(auth_id());
        $teacherId          = null;
        $courseCount        = 0;
        $classCount         = 0;
        $courses            = [];
        $subjectNames       = [];
        $materialStats      = ['total' => 0, 'published' => 0, 'draft' => 0];
        $assignmentStats    = ['total' => 0, 'published' => 0, 'draft' => 0, 'pending' => 0];
        $assignmentByCourse = [];

        if ($teacher) {
            $teacherId = (int) (is_object($teacher) ? $teacher->id : $teacher['id']);

            $courseModel = new CourseModel();
            $courseCount = (int) $courseModel->countByTeacher($teacherId);
            $classCount  = (int) $courseModel->countClassesByTeacher($teacherId);

            $courses = array_map(
                static fn ($row) => (array) $row,
                $courseModel->getByTeacher($teacherId)
            );

            foreach ((new SubjectModel())->findAll() as $s) {
---
SELECT *
FROM `subjects`

    private function assignmentSummary(int $teacherId): array
    {
        $db        = \Config\Database::connect();
        $perCourse = [];

        $rows = $db->table('assignments a')
            ->select('a.course_id, COUNT(*) AS total, SUM(CASE WHEN a.is_published = 1 THEN 1 ELSE 0 END) AS published')
            ->join('courses c', 'c.id = a.course_id')
            ->where('c.teacher_id', $teacherId)
            ->groupBy('a.course_id')
            ->get()
            ->getResultArray();

        foreach ($rows as $r) {
            $perCourse[(int) $r['course_id']] = [
                'total'     => (int) $r['total'],
                'published' => (int) $r['published'],
                'pending'   => 0,
            ];
        }

        $pendingRows = $db->table('submissions sub')
            ->select('a.course_id, COUNT(*) AS pending')
            ->join('assignments a', 'a.id = sub.assignment_id')
            ->join('courses c', 'c.id = a.course_id')
            ->join('course_students cs', 'cs.course_id = a.course_id AND cs.student_id = sub.student_id')
            ->where('c.teacher_id', $teacherId)
            ->where('a.is_published', 1)
            ->where('sub.submitted_at IS NOT NULL', null, false)
            ->where('sub.graded_at IS NULL', null, false)
            ->groupBy('a.course_id')
            ->get()
            ->getResultArray();
---
SELECT `a`.`course_id`, COUNT(*) AS total, SUM(CASE WHEN a.is_published = 1 THEN 1 ELSE 0 END) AS published
FROM `assignments` `a`
JOIN `courses` `c` ON `c`.`id` = `a`.`course_id`
WHERE `c`.`teacher_id` = 1
GROUP BY `a`.`course_id`
SELECT `a`.`course_id`, COUNT(*) AS pending
FROM `submissions` `sub`
JOIN `assignments` `a` ON `a`.`id` = `sub`.`assignment_id`
JOIN `courses` `c` ON `c`.`id` = `a`.`course_id`
JOIN `course_students` `cs` ON `cs`.`course_id` = `a`.`course_id` AND `cs`.`student_id` = `sub`.`student_id`
WHERE `c`.`teacher_id` = 1
AND `a`.`is_published` = 1
AND sub.submitted_at IS NOT NULL
AND sub.graded_at IS NULL
GROUP BY `a`.`course_id`