app/Helpers/auth_helper.php

SELECT `id`, `name`, `username`, `role`, `is_active`
FROM `users`
WHERE `users`.`id` = 5
---
    function auth_guard(?string $role = null): ?RedirectResponse
    {
        if (! auth_check()) {
            return redirect()->to(site_url('login'))
                ->with('error', 'Silakan login terlebih dahulu.');
        }

        $user = model(UserModel::class)
            ->select('id, name, username, role, is_active')
            ->find(auth_id());