app/Models/AnnouncementModel.php

SELECT `announcements`.*, `courses`.`title` AS `course_title`, `courses`.`teacher_id` AS `course_teacher_id`, `classes`.`name` AS `class_name`, `subjects`.`name` AS `subject_name`, `users`.`name` AS `author_name`
FROM `announcements`
LEFT JOIN `courses` ON `courses`.`id` = `announcements`.`course_id`
LEFT JOIN `classes` ON `classes`.`id` = `courses`.`class_id`
LEFT JOIN `subjects` ON `subjects`.`id` = `courses`.`subject_id`
LEFT JOIN `users` ON `users`.`id` = `announcements`.`author_id`
LEFT JOIN `course_students` `cs` ON `cs`.`course_id` = `announcements`.`course_id` AND `cs`.`student_id` = 2
WHERE `announcements`.`is_published` = 1
AND   (
announcements.course_id IS NULL
OR cs.id IS NOT NULL
 )
AND `announcements`.`id` = 1
 LIMIT 1
---
    private function visibleToStudent(?int $studentId): static
    {
        $builder = $this->withRelations()->where('announcements.is_published', 1);

        if ($studentId === null) {
            return $builder->where('announcements.course_id IS NULL', null, false);