app/Models/AssignmentModel.php

SELECT COUNT(*) AS total, COALESCE(SUM(is_published = 1), 0) AS published, COALESCE(SUM(is_published = 0), 0) AS draft
FROM `assignments`
WHERE `course_id` = 1
---
    public function countByCourse(int $courseId): array
    {
        $row = $this->db->table('assignments')
            ->select(
                'COUNT(*) AS total, '
                . 'COALESCE(SUM(is_published = 1), 0) AS published, '
                . 'COALESCE(SUM(is_published = 0), 0) AS draft',
                false
            )
            ->where('course_id', $courseId)
            ->get()
            ->getRowArray();