app/Models/CourseStudentModel.php

    public function isEnrolled(int $courseId, int $studentId): bool
    {
        return $this->where('course_id', $courseId)
            ->where('student_id', $studentId)
            ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `course_students`
WHERE `course_id` = 1
AND `student_id` = 1