app/Models/CourseModel.php

SELECT COUNT(*) AS `numrows`
FROM `courses`
WHERE `teacher_id` = 1
---
    public function countByTeacher(int $teacherId): int
    {
        return $this->where('teacher_id', $teacherId)->countAllResults();

SELECT COUNT(DISTINCT class_id) AS total
FROM `courses`
WHERE `teacher_id` = 1
 LIMIT 1
---
    public function countClassesByTeacher(int $teacherId): int
    {
        $row = $this->select('COUNT(DISTINCT class_id) AS total', false)
            ->where('teacher_id', $teacherId)
            ->first();