app/Models/MaterialViewModel.php

    public function getProgressByStudent(int $studentId): array
    {
        $total = (int) $this->db->table('materials m')
            ->join('course_students cs', 'cs.course_id = m.course_id')
            ->where('cs.student_id', $studentId)
            ->where('m.is_published', 1)
            ->countAllResults();

        $viewed = (int) $this->db->table('material_views mv')
            ->join('materials m', 'm.id = mv.material_id')
            ->join('course_students cs', 'cs.course_id = m.course_id AND cs.student_id = mv.student_id')
            ->where('mv.student_id', $studentId)
            ->where('m.is_published', 1)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `materials` `m`
JOIN `course_students` `cs` ON `cs`.`course_id` = `m`.`course_id`
WHERE `cs`.`student_id` = 2
AND `m`.`is_published` = 1
SELECT COUNT(*) AS `numrows`
FROM `material_views` `mv`
JOIN `materials` `m` ON `m`.`id` = `mv`.`material_id`
JOIN `course_students` `cs` ON `cs`.`course_id` = `m`.`course_id` AND `cs`.`student_id` = `mv`.`student_id`
WHERE `mv`.`student_id` = 2
AND `m`.`is_published` = 1