app/Models/MaterialModel.php

SELECT `materials`.`id`, `materials`.`course_id`, `materials`.`title`, `materials`.`description`, `materials`.`published_at`, `materials`.`file_name`, `materials`.`video_url`, `mv`.`viewed_at` AS `viewed_at`
FROM `materials`
LEFT JOIN `material_views` `mv` ON `mv`.`material_id` = `materials`.`id` AND `mv`.`student_id` = 2
WHERE `materials`.`course_id` = 2
AND `materials`.`is_published` = 1
ORDER BY `materials`.`published_at` ASC, `materials`.`id` ASC
---
    public function getPublishedByCourse(int $courseId, ?int $studentId = null): array
    {
        $builder = $this->select('materials.id, materials.course_id, materials.title, materials.description, materials.published_at, materials.file_name, materials.video_url')
            ->where('materials.course_id', $courseId)
            ->where('materials.is_published', 1)
            ->orderBy('materials.published_at', 'ASC')
            ->orderBy('materials.id', 'ASC');

        if ($studentId !== null) {
            $builder->select('mv.viewed_at AS viewed_at')
                ->join('material_views mv', 'mv.material_id = materials.id AND mv.student_id = ' . (int) $studentId, 'left');
        }

        return $builder->findAll();

SELECT COUNT(materials.id) AS total, COALESCE(SUM(materials.is_published = 1), 0) AS published
FROM `materials`
WHERE `materials`.`course_id` = 1
---
    public function countByCourse(int $courseId): array
    {
        $row = $this->builder()
            ->select('COUNT(materials.id) AS total, COALESCE(SUM(materials.is_published = 1), 0) AS published', false)
            ->where('materials.course_id', $courseId)
            ->get()
            ->getRowArray();

SELECT COUNT(materials.id) AS total, COALESCE(SUM(materials.is_published = 1), 0) AS published
FROM `materials`
JOIN `courses` ON `courses`.`id` = `materials`.`course_id`
WHERE `courses`.`teacher_id` = 1
---
    public function countByTeacher(int $teacherId): array
    {
        $row = $this->builder()
            ->select('COUNT(materials.id) AS total, COALESCE(SUM(materials.is_published = 1), 0) AS published', false)
            ->join('courses', 'courses.id = materials.course_id')
            ->where('courses.teacher_id', $teacherId)
            ->get()
            ->getRowArray();