app/Models/QuestionModel.php

SELECT COALESCE(SUM(points), 0) AS total
FROM `questions`
WHERE `quiz_id` = 20
---
    public function totalPoints(int $quizId): int
    {
        $row = $this->db->table($this->table)
            ->select('COALESCE(SUM(points), 0) AS total', false)
            ->where('quiz_id', $quizId)
            ->get()
            ->getRowArray();

SELECT *
FROM `questions`
WHERE `quiz_id` = 20
ORDER BY `order_number` ASC, `id` ASC
SELECT `id`, `question_id`, `option_text`, `option_key`, `order_number`, `is_correct`
FROM `quiz_options`
WHERE `question_id` IN (19)
ORDER BY `order_number` ASC, `id` ASC
---
    public function getWithOptions(int $quizId, bool $includeCorrect = true): array
    {
        $questions = $this->where('quiz_id', $quizId)
            ->orderBy('order_number', 'ASC')
            ->orderBy('id', 'ASC')
            ->findAll();

        if ($questions === []) {
            return [];
        }

        $ids  = array_map('intval', array_column($questions, 'id'));
        $cols = 'id, question_id, option_text, option_key, order_number' . ($includeCorrect ? ', is_correct' : '');

        $rows = $this->db->table('quiz_options')
            ->select($cols)
            ->whereIn('question_id', $ids)
            ->orderBy('order_number', 'ASC')
            ->orderBy('id', 'ASC')
            ->get()
            ->getResultArray();