app/Models/QuizAnswerModel.php

SELECT `question_id`, `option_id`
FROM `quiz_answers`
WHERE `attempt_id` = 13
---
    public function getByAttempt(int $attemptId): array
    {
        $rows = $this->db->table($this->table)
            ->select('question_id, option_id')
            ->where('attempt_id', $attemptId)
            ->get()
            ->getResultArray();

SELECT COALESCE(SUM(q.points), 0) AS earned
FROM `quiz_answers` `a`
JOIN `quiz_options` `o` ON `o`.`id` = `a`.`option_id` AND `o`.`question_id` = `a`.`question_id`
JOIN `questions` `q` ON `q`.`id` = `a`.`question_id`
WHERE `a`.`attempt_id` = 13
AND `o`.`is_correct` = 1
---
    public function earnedPoints(int $attemptId): int
    {
        $row = $this->db->table('quiz_answers a')
            ->select('COALESCE(SUM(q.points), 0) AS earned', false)
            ->join('quiz_options o', 'o.id = a.option_id AND o.question_id = a.question_id')
            ->join('questions q', 'q.id = a.question_id')
            ->where('a.attempt_id', $attemptId)
            ->where('o.is_correct', 1)
            ->get()
            ->getRowArray();