app/Models/QuizAttemptModel.php

SELECT *
FROM `quiz_attempts`
WHERE `quiz_id` = 20
AND `student_id` = 1
---
    public function findByQuizAndStudent(int $quizId, int $studentId): ?array
    {
        $row = $this->db->table($this->table)
            ->where('quiz_id', $quizId)
            ->where('student_id', $studentId)
            ->get()
            ->getRowArray();

INSERT INTO `quiz_attempts` (`quiz_id`, `student_id`, `started_at`, `status`, `created_at`, `updated_at`) VALUES (20, 1, '2026-10-06 18:13:57', 'in_progress', '2026-10-06 18:13:57', '2026-10-06 18:13:57')
---
    public function start(int $quizId, int $studentId): ?array
    {
        $existing = $this->findByQuizAndStudent($quizId, $studentId);

        if ($existing !== null) {
            return $existing;
        }

        try {
            $this->insert([
                'quiz_id'    => $quizId,
                'student_id' => $studentId,
                'started_at' => date('Y-m-d H:i:s'),
                'status'     => self::STATUS_IN_PROGRESS,
            ]);

SELECT `id`
FROM `quiz_attempts`
WHERE `quiz_id` = 20
AND `status` = 'in_progress'
---
    public function finalizeExpiredByQuiz(int $quizId, ?string $now = null): int
    {
        $ids = $this->db->table($this->table)
            ->select('id')
            ->where('quiz_id', $quizId)
            ->where('status', self::STATUS_IN_PROGRESS)
            ->get()
            ->getResultArray();

SELECT `course_id`
FROM `quizzes`
WHERE `id` = 20
SELECT `s`.`id` AS `student_id`, `s`.`nis`, `u`.`name`, `c`.`name` AS `class_name`, `qa`.`id` AS `attempt_id`, `qa`.`status`, `qa`.`started_at`, `qa`.`submitted_at`, `qa`.`score`
FROM `course_students` `cs`
JOIN `students` `s` ON `s`.`id` = `cs`.`student_id`
JOIN `users` `u` ON `u`.`id` = `s`.`user_id`
LEFT JOIN `classes` `c` ON `c`.`id` = `s`.`class_id`
LEFT JOIN `quiz_attempts` `qa` ON `qa`.`quiz_id` = 20 AND `qa`.`student_id` = `s`.`id`
WHERE `cs`.`course_id` = 1
ORDER BY `u`.`name` ASC
---
    public function getRosterByQuiz(int $quizId): array
    {
        $quiz = $this->db->table('quizzes')
            ->select('course_id')
            ->where('id', $quizId)
            ->get()
            ->getRowArray();

        if (! $quiz) {
            return [];
        }

        return $this->db->table('course_students cs')
            ->select(
                's.id AS student_id, s.nis, u.name, c.name AS class_name, '
                . 'qa.id AS attempt_id, qa.status, qa.started_at, qa.submitted_at, qa.score'
            )
            ->join('students s', 's.id = cs.student_id')
            ->join('users u', 'u.id = s.user_id')
            ->join('classes c', 'c.id = s.class_id', 'left')
            ->join(
                'quiz_attempts qa',
                'qa.quiz_id = ' . (int) $quizId . ' AND qa.student_id = s.id',
                'left'
            )
            ->where('cs.course_id', (int) $quiz['course_id'])
            ->orderBy('u.name', 'ASC')
            ->get()
            ->getResultArray();