app/Models/QuizModel.php

    public function countByCourse(int $courseId): array
    {
        $row = $this->db->table('quizzes')
            ->select(
                'COUNT(*) AS total, '
                . 'COALESCE(SUM(is_published = 1), 0) AS published, '
                . 'COALESCE(SUM(is_published = 0), 0) AS draft',
                false
            )
            ->where('course_id', $courseId)
            ->get()
            ->getRowArray();
---
SELECT COUNT(*) AS total, COALESCE(SUM(is_published = 1), 0) AS published, COALESCE(SUM(is_published = 0), 0) AS draft
FROM `quizzes`
WHERE `course_id` = 1

    public function hasAttempts(int $quizId): bool
    {
        return $this->db->table('quiz_attempts')
            ->where('quiz_id', $quizId)
            ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `quiz_attempts`
WHERE `quiz_id` = 20