app/Models/SchoolSettingModel.php

SELECT *
FROM `school_settings`
ORDER BY `id` ASC
 LIMIT 1
---
    public function current(): ?array
    {
        $row = $this->orderBy('id', 'ASC')->first();