app/Models/StudentModel.php

    private function baseQuery(): static
    {
        return $this->select('students.*, users.name, users.username, users.email, users.is_active, classes.name AS class_name, classes.grade AS class_grade')
            ->join('users', 'users.id = students.user_id')
            ->join('classes', 'classes.id = students.class_id', 'left');
---
SELECT `students`.*, `users`.`name`, `users`.`username`, `users`.`email`, `users`.`is_active`, `classes`.`name` AS `class_name`, `classes`.`grade` AS `class_grade`
FROM `students`
JOIN `users` ON `users`.`id` = `students`.`user_id`
LEFT JOIN `classes` ON `classes`.`id` = `students`.`class_id`
ORDER BY `users`.`name` ASC