app/Models/TeacherModel.php

SELECT `teachers`.*, `users`.`name`, `users`.`username`, `users`.`email`, `users`.`is_active`
FROM `teachers`
JOIN `users` ON `users`.`id` = `teachers`.`user_id`
ORDER BY `users`.`name` ASC
---
    private function baseQuery(): static
    {
        return $this->select('teachers.*, users.name, users.username, users.email, users.is_active')
            ->join('users', 'users.id = teachers.user_id');